Tekla Open API Reference for Tekla Structures 2025
SurfaceObject.Class Property
 Gets or sets the class of the surface object.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string Class { get; set; }
Public Property Class As String
	Get
	Set
Property Value
Type: String
See Also
Reference
SurfaceObject Class
Tekla.Structures.Model Namespace